src/DataProcessors/vsc_НастройкаПравилСозданияМенеджераОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>vsc_НастройкаПравилСозданияМенеджераОбмена</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Конвертация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Конвертации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогДляГотовыхФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияПлатформыДляГенерацииEPF</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/DataProcessors/vsc_НастройкаПравилСозданияМенеджераОбмена/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Конвертация") Тогда
		Объект.Конвертация = Параметры.Конвертация;
		
		Настройки = Обработки.vsc_НастройкаПравилСозданияМенеджераОбмена.ПрочитатьНастройки(Объект.Конвертация);
		
		Объект.КаталогДляГотовыхФайлов        = Настройки.КаталогДляГотовыхФайлов;
		Объект.ВерсияПлатформыДляГенерацииEPF = Настройки.ВерсияПлатформыДляГенерацииEPF;
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
//Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы


&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкиНаСервере()
	Обработки.vsc_НастройкаПравилСозданияМенеджераОбмена.ЗаписатьНастройки(Объект.Конвертация,Объект.КаталогДляГотовыхФайлов,Объект.ВерсияПлатформыДляГенерацииEPF);
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНастройки(Команда)
	ЗаписатьНастройкиНаСервере();
	ЭтаФорма.Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
//Код процедур и функций
#КонецОбласти
